# coding: utf-8
module Cyrillizer
  
  class << self
    attr_writer :language
    def language
      @language || :macedonian
    end
  end
  
  module Alphabet

    Macedonian = {'Џ' => 'DZH', 'Џ' => 'Dzh', 'џ' => 'dzh', 'Ѓ' => 'GJ', 'Ѓ' => 'Gj', 'ѓ' => 'gj', 'Ж' => 'ZH', 'Ж' => 'Zh', 'ж' => 'zh', 'Ѕ' => 'DZ', 'Ѕ' => 'Dz', 'ѕ' => 'dz',
                  'Љ' => 'LJ', 'Љ' => 'Lj', 'љ' => 'lj', 'Њ' => 'NJ', 'Њ' => 'Nj', 'њ' => 'nj', 'Ќ' => 'KJ', 'Ќ' => 'Kj', 'ќ' => 'kj', 'Ч' => 'CH', 'Ч' => 'Ch', 'ч' => 'ch',
                  'Ш' => 'SH', 'Ш' => 'Sh', 'ш' => 'sh', 'А' => 'A', 'а' => 'a', 'Б' => 'B', 'б' => 'b', 'В' => 'V', 'в' => 'v', 'Г' => 'G', 'г' => 'g', 'Д' => 'D', 'д' => 'd',
                  'Е' => 'E', 'е' => 'e', 'З' => 'Z', 'з' => 'z', 'И' => 'I', 'и' => 'i', 'Ј' => 'J', 'ј' => 'j', 'К' => 'K', 'к' => 'k', 'Л' => 'L', 'л' => 'l', 'М' => 'M',
                  'м' => 'm', 'Н' => 'N', 'н' => 'n', 'О' => 'O', 'о' => 'o', 'П' => 'P', 'п' => 'p', 'Р' => 'R', 'р' => 'r', 'С' => 'S', 'с' => 's', 'Т' => 'T', 'т' => 't',
                  'У' => 'U', 'у' => 'u', 'Ф' => 'F', 'ф' => 'f', 'Х' => 'H', 'х' => 'h', 'Ц' => 'C', 'ц' => 'c'}

    Russian    = {'А' => 'A', 'а' => 'a', 'Б' => 'B', 'б' => 'b', 'В' => 'V', 'в' => 'v', 'Г' => 'G', 'г' => 'g', 'Д' => 'D', 'д' => 'd', 'Е' => 'e', 'е' => 'e', 'Ё' => 'Ye',
                  'ё' => 'ye', 'Ж' => 'Zh', 'ж' => 'zh', 'З' => 'Z', 'з' => 'z', 'И' => 'I', 'и' => 'i', 'Й' => 'Y', 'й' => 'y', 'К' => 'k', 'к' => 'k', 'Л' => 'L', 'л' => 'l',
                  'М' => 'M', 'м' => 'm', 'Н' => 'N', 'н' => 'n', 'О' => 'o', 'о' => 'o', 'П' => 'P', 'п' => 'p', 'Р' => 'R', 'р' => 'r', 'С' => 'S', 'с' => 's', 'Т' => 'T',
                  'т' => 't', 'У' => 'U', 'у' => 'u', 'Ф' => 'F', 'ф' => 'f', 'Х' => 'H', 'х' => 'h', 'Ц' => 'Ts', 'ц' => 'ts', 'Ч' => 'Ch', 'ч' => 'ch', 'Ш' => 'Sh', 'ш' => 'sh',
                  'Щ' => 'Shch', 'щ' => 'Shch', 'Ъ' => '', 'ъ' => '', 'Ь' => '', 'ь' => '', 'Ю' => 'Yu', 'ю' => 'yu', 'Я' => 'Ya', 'я' => 'ya'}


  end
end
